const ruQuest={
    "quest1": "Что такое HTML",
    "answer1": "HTML (от англ. HyperText Markup Language) — стандартный язык разметки веб-страниц. Он позволяет создавать и структурировать разделы, абзацы и ссылки с помощью элементов HTML (строительных блоков веб-страниц), таких как теги и атрибуты.",
    "quest2": "Какие основные теги HTML вы знаете?",
    "answer2": "div, header, main, section и footer - это основные теги HTML5 для создания семантической структуры веб-страницы. Также можно упомянуть теги, такие как p, h1-h6, ul, ol, li, a, img и т.д., которые используются для создания содержимого веб-страницы.",
    "cssq1": "Что такое селектор CSS?",
    "cssq1answer":"Селектор CSS (Cascading Style Sheets) - это часть CSS-правила, которая определяет, какие элементы HTML на странице будут стилизованы этим правилом. Селекторы выбирают элементы на основе их имени тега, атрибутов, классов или идентификаторов.",
    "jsq1":"Какие типы данных есть в JavaScript?",
    "jsq1answer":"Примитивные типы данных:\n\nЧисла (numbers): представляют как целые, так и дробные числа;\nСтроки (strings): представляют текстовые данные;\nБулевы значения (booleans): представляют истину (true) или ложь (false);\nNull: представляет отсутствие значения;\nUndefined: представляет отсутствие определения значения;\nSymbol (введен в ECMAScript 6): представляет уникальный и неизменяемый идентификатор.\n\nОбъекты:\nОбъекты (objects): хранят данные в формате ключ-значение;\nМассивы (arrays): это объекты, которые хранят упорядоченные коллекции значений;\nФункции (functions): используются для выполнения конкретных задач;\nДаты (dates): представляют даты и времена;\nРегулярные выражения (regular expressions): используются для работы с текстом, выполняют поиск и замену.",
    "jsq2":"Получить четные числа из массива",
    "jsq3":"Массив строк в масив чисел",
    "jsq3desc":" Вариант с помощью map",
    "jsq3desc2":" Вариант с помощью цикла 'for' "


  }
  export default ruQuest